"DOWNGRADE_TITLE" = "최신 버전의 Java가 이미 설치되어 있습니다.";

"DOWNGRADE_MESSAGE" = "%1$@을(를) 설치하려고 시도하는 중이지만 %2$@이(가) 이미 설치되어 있습니다.\n자세한 내용을 보려면 java.com/newerversionexists를 방문하십시오.";

"Restore Security Prompts" = "보안 프롬프트 복원";

"Browser Plug-in Disabled" = "브라우저 플러그인 사용 안함";

"Continue" = "계속";

"Close" = "닫기";

"Install" = "설치";

"Finish" = "완료";

"You have Successfully Installed %@ \nand the Ask extension(s)." = "%1$@ 및 Ask 확장을 성공적으로 \n설치했습니다.";

"The security level has been set to a minimum value of High." = "보안 레벨은 최소값인 '높음'으로 설정되었습니다.";

/* Dynamic welcome string */
"Welcome to the %@ Installer" = "%1$@ 설치 프로그램 시작";

/* Dynamic complete string */
"You have successfully installed %@." = "%1$@을(를) 성공적으로 설치했습니다.";

"Information about" = "Oracle Java SE 로드맵에 대한 중요한 정보:";

"Oracle has announced" = "향후 Oracle Java SE 릴리스에 대한 액세스에 영향을 주는 변경사항이 있습니다. ";

"Corporate users may" = "기업 사용자는 2019년 1월부터 영향을 받습니다. ";

"and others" = "추가 지침을 보려면 다음 링크로 이동하십시오.\n";

"More Information on roadmap" = "로드맵에 대한 자세한 정보";

"Changes are" = "향후 Oracle Java SE 릴리스에 대한 액세스에 영향을 주는 변경사항이 있습니다.\n\n";

"Corporate users" = "기업 사용자는 2019년 4월 업데이트의 영향을 받습니다.\n\n";

"These changes" = "이러한 변경사항은 설치하려는 버전에 영향을 주지 않습니다.";

"For additional" = "추가 지침을 보려면 다음 링크로 이동하십시오.\n\n";

"More Information..." = "추가 정보...";

"Important Info" = "Oracle Java SE 로드맵에 대한 중요한 정보";

"OK" = "확인";

"Java provides" = "Java는 놀라운 콘텐츠 세계로의 액세스를 제공합니다. 비즈니스 솔루션에서 유용한 유틸리티 및 엔터테인먼트까지 Java는 인터넷 경험을 현실로 만들어 드립니다.\n\n";

"Note: No" = "참고: 설치 프로세스의 일부로 개인 정보가 수집되지 않습니다.\n";

/* hyperlink - do not use punctuation */
"Click here" = "수집되는 정보에 대한 자세한 내용을 보려면";

/* Click here for more information on what we do collect. is the full sentence */
" for more" = " 여기를 누르십시오.";

"Click Install" = "라이센스 계약서에 동의하고 ";

"license agreement" = "지금 Java를 설치하려면";

" and install" = " [설치]를 누르십시오.";

"Install >" = "설치 >";

"Please remove" = "이전 버전의 Java를 제거하십시오.";

"The Java software" = "이 컴퓨터의 Java 소프트웨어는 최신 버전이 아니며 업데이트가 더 이상 필요하지 않습니다.\n\n";

"Keeping out-of-date" = "시스템에 오래된 Java 버전을 유지하면 보안 위험이 따를 수 있습니다.\n\n";

"If you still" = "제거한 후에도 데스크톱 애플리케이션을 실행할 Java가 필요한 경우 ";

" for a recommended" = "을 방문하여 권장 버전을 확인하십시오.";

"Remove" = "제거 >";

"Java Deployment" = "Java 배치 캐시";

"Java maintains" = "Java는 일반적으로 사용되는 Java 프로그램의 다시 로드 속도를 높이기 위해 캐시를 유지하고 추적 및 로그 파일을 저장합니다. Java Runtime을 제거할 때는 이 캐시도 제거하여 컴퓨터 공간을 확보하는 것이 좋습니다.\n\n자세히 알아보기 - ";

"Java Deployment Cache" = "Java 배치 캐시";

"Would you like" = "\n\nJava 캐시를 제거하겠습니까(권장)?";

"Yes" = "예";

"No" = "아니오";

"Uninstalled" = "Java를 성공적으로 제거했습니다.";

"NoJavaToUninstall" = "시스템에서 감지된 Java 설치가 없습니다.";

"Complete" = "완료";

"Later" = "나중에";

"Update" = "업데이트";

"Please remove unused" = "사용하지 않는 버전의 Java를 제거하십시오.";

/* It appears that you have not used Java on your system in over 6 months. We recommend that you uninstall it by clicking the Remove button below. */
"It appears that" = "시스템에서 Java를 6개월 이상 사용하지 않았습니다. 아래의 ";
" Remove" = "제거";
" button below." = " 단추를 눌러 제거하는 것이 좋습니다.";

"If you later" = " 나중에 Java가 필요하면 java.com에서 다시 설치할 수 있습니다.";

/* If you wish to" = "If you wish to keep Java on your system, please update it by clicking the Update button below. */
"If you wish to" = "시스템에 Java를 유지하려는 경우 아래의 ";
" Update" = "업데이트";

"Fail to install" = "Java 설치를 실패했습니다.";

"Uninstalling" = "Java 제거 중...";

"Fail to uninstall" = "Java 제거 실패: %@";

"XPC connection error." = "XPC 접속 오류입니다.";

"Error code" = "OS 오류 코드 %lld입니다.";

"shell is not available." = "셸을 사용할 수 없습니다.";

"process cannot be created." = "프로세스를 생성할 수 없습니다.";

"Commercial License" = "이 버전에 상용 라이센스 필요";

"Use of this" = "이 버전을 사용하려면 직접 또는 소프트웨어 제공자 중 하나가 취득한 상용 라이센스가 있어야 합니다.";

"You can also" = "Java Runtime이 필요한 라이센스가 있는 Oracle 제품을 실행하는 데도 이 버전을 사용할 수 있습니다.";

"Learn more about this release" = "이 릴리스에 대해 자세히 알아보기";

"Details on the" = "수집되는 정보에 대한 세부정보";

"cannot delete" = "Java 배치 캐시를 삭제할 수 없습니다.";

"Password prompt" = "%@을(를) 계속하려면 권한이 필요합니다.";

"Java Update" = "Java Update";

"OSCHECK_TITLE" = "Oracle의 Java를 사용하려면 %1$@ %2$@ 이상이 필요합니다.";

"OSCHECK_MESSAGE" = "사용자의 시스템에는 %1$@ 버전 %2$@이(가) 설치되어 있습니다. 버전 %3$@ 이상에 이 제품을 설치할 수 있습니다.\n자세한 내용을 보려면 java.com/help를 방문하십시오.";

"Welcome to Java" = "Java 시작";

"This version" = "이 버전의 Java를 사용하려면 Oracle이나 인증을 받은 Oracle 파트너사 또는 인증을 받은 타사 소프트웨어 제공자가 제공하는 Oracle Java SE 라이센스가 있어야 합니다. 적절한 라이센스 사용 여부를 확인하는 것은 사용자의 책임입니다. 이에 동의하면 [설치]를 눌러 설치 프로세스를 계속하십시오.";

"If you have" = "라이센스가 없는 경우 [제거]를 눌러 설치 프로세스를 정지하고 이전 Java 버전을 제거할지 여부를 선택하십시오.";

"No personal" = "설치 프로세스의 일부로 개인 정보가 수집되지 않습니다";

"Welcome to Java -" = "Java 시작 - 업데이트된 라이센스 조항";

"The terms" = "이 버전의 소프트웨어에 적용되는 라이센스 조항이 변경되었습니다.";

"Updated License" = "업데이트된 라이센스 계약서";

"This version -" = "이 버전의 Java Runtime은 개인용(비상업용) 데스크톱 및 랩톱 용도로만 사용이 허가되었습니다.";

"Commercial use" = "이 소프트웨어를 상업용으로 사용하기 위해서는 Oracle 또는 해당 소프트웨어 공급업체에서 제공하는 별도의 라이센스가 필요합니다.";

"Click install or" = "라이센스 계약에 동의하고 지금 Java를 설치하려면 [설치]를 누르고, 시스템에서 제거하려면 [제거]를 누르십시오.";

"Remove -" = "제거";
